{
  "currency": "coin",

  "inventory_help": "This is your backpack. Click on an item to see what you can do with it. Some pieces of equipment can increase your inventory size. The capsule at the top of the panel is your amount of money.",
  "equipment_help": "This is your equipment. Click on a piece of equipment to unequip it. You cannot equip a ranged weapon and a melee weapon at the same time. You must equip an ammo container (e.g. quiver) before equipping the corresponding ammunition (e.g. arrows).",
  "belt_help": "This is your belt. You can only use or equip an item during a battle if it's in your belt. Click on an item in your backpack if you want to put it in your belt, or vice versa.",
  "self_map_help": "Click on the map to center it elsewhere. The red cross is your current position.",
  "stats_help": "These are you character stats. Their values influence the success and impact of various actions. Most of them can be increased by specific pieces of equipment.",
  "recipes_help": "Click on an item recipe to start crafting it. The recipes that appear in the list are the recipes that are either known by you or by the owner of the workshop. For each recipe, the price in the top-right corner represents the fee you need to pay to craft the item. The numbers in the bottom-right corner indicate how many of the required ingredients you own (if they are green, you have all you need!)",
  "combi_help": "After selecting an item to craft in the \"recipes\" panel, the list of ingredients will appear below. The '+' and '-' buttons allow you to select how many items to craft.",
  "status_help": "Path XP is gained by performing actions related to your path. As you gain more levels, you get better at your trade. Civic XP is acquired by contributing to your settlement, primarily through commitment, and helps you gain civic levels. Higher civic levels allow you to vote for the Governor, to be named Chancellor or Commander, or even to be elected Governor yourself.",

  "battle_help": "The colored tiles delimit the battle zone. You cannot leave it until either the battle ends or you die. Other players and creatures can step into it to join the fight. ",
  "battletimer_help": "Battles are turn-based. Each fighter has a few seconds to take an action (moving, attacking, using an item, equipping something). When an action is taken or when the timer reaches 0, the turn ends and the turn of the next fighter in the list starts.",
  "battleitems_help": "The equipment pieces relevant for battle are displayed here, and below, the items you can use in battle. Click on an equipped item will unequip it and end your turn. Clicking on an item will equip or use it and end your turn. The red bar at the bottom represents your health.",
  "respawn_help": "When your health reaches 0, you collapse. Someone eventually comes to take you back to a safe location where you can get back up on your feet. This process is called \"respawn\" and takes a bit of time; you need to wait for the counter to reach 0.",

  "build_help": "This is the list of buildings. You can only own 1 building of each type; once built, it disappears from the list. Click on a building and then on a suitable location on the ground to build it.",
  "resources_help": "The stockpile of resources of the settlement, gathered by resource buildings or moved from the Trade Post. The capsule above indicates the amount of currency in the coffers of the Fort.",
  "setstatus_help": "Basic information about the settlement. The food surplus or deficit corresponds to the excess (or lack thereof) of food with respect to the amount that must be maintained at all times to feed the current population. Food surplus or deficit increases or decreases, respectively, the productivity of buildings and the stats of the citizens.",
  "devlvl_help": "The list of goals to meet for the settlement to be able to reach the next development level. Development levels unlock new buildings, access to new resources and many other useful things.",
  "productivity_help": "Indicates all the factors that are affecting the productivity of this building, and how. The higher the productivity, the faster the building will be built, or the more resources it will produce. Food surplus is achieved by storing enough food at the fort. Commitment indicates how many citizens are committing themselves to this building at the moment. ",
  "progress_help": "This building is under construction. You can see the progress and the construction materials that are missing.",
  "sell_help": "This panel displays the items that you own. By clicking on them, you can either sell them (if you don't own the building) or give them to the building stock (if you own the building). The selling price is indicated in the top-right corner. '--' means that the shop doesn't buy the item. The capsule at the top of the panel indicates your amount of money.",
  "buy_help": "This panel displays the items that are in the building's inventory. By clicking on them, you can either buy them (if you don't own the building) or take them for free from the building stock (if you own the building). The price is indicated in the top-right corner. '--' means that the shop doesn't sell the item at the moment. The capsule at the top of the panel indicates the amount of money in the shop's coffers.",
  "prod_help": "This building produces resources at regular intervals. For each resource, the progress bar gradually fills. When it is filled, the amount of resource indicated to the left of the bar is added to the stock. The current stock of each resource is displayed in the bottom-right corner. Click on a resource to buy some of it from the stock. If food is stored in the building, it will produce twice as much and consume the food gradually.",
  "prices_help": "Enter the name of some item you would like to buy or sell at your shop. If the item exists, it will be displayed below and you can freely adjust the buy and sell prices. Setting a buying price to 0 means you do not want to let players sell it to your shop. Setting a selling price of 0 means you do not want to let players buy it, even if it is stored in your shop.",
  "shack_help": "While in a resting place, your vigor and vitality will gradually recover. Certain resting places restore more vigor and vitality than other.",
  "gold_help": "The amount of currency you currently own.",
  "shopgold_help": "The amount of currency in the coffers of the building.",
  "backpack_help": "The amount of free slots left in your backpack.",
  "vigor_help": "Your energy level; decreases as you perform actions, increases when you rest in a shelter. Can negatively impact your other stats.",
  "food_help": "Your food level; decreases over time, increases when you eat. Can speed up your loss of vigor.",
  "health_help": "Your health level, decreases when you fight, increases when resting or consuming healing items. Should be kept above 0!",
  "repair_help": "You can repair any damaged building by providing Timber to it. The progress bar indicates if the building is damaged or fully restored.",

  "classxp": "XP",
  "class_selection_title": "Pick your path",
  "class_selection": "Select carefully the path you'll follow. Each comes with unique benefits and will define your role in the economy and the settlement of the Continent. In the end, however, remember that all paths lead West...",
  "settlement_intro": "Select in which region you want to begin your adventure. This has little impact at the moment. Once you have selected a region, you are free to travel to other regions (and encouraged to do so for trade), but the trip may be long and dangerous! Click on the blinking icons on the map to make your choice.",
  "welcome": ["Welcome to Westward!",
    "Here is a quick tour of the controls.",
    "Click on the ground to move, or click on a building to go and visit it.",
    "Click on animals and suspicious characters to attack them (if they don't attack you first).",
    "Press enter to open the chat bar and say nice stuff to the other players.",
    "The icons in the top-right corner of the screen, around the minimap, open different menus, you should explore them!",
    "Have fun!"],
  "not_implemented": "The following features are mentioned in the demo but not implemented yet: development levels, using bombs in battle and fatigue. In addition, the enemy civilization is totally absent at the moment, and it is not possible to elect Governors yet. Not to mention all the other planned features that are not mentioned anywhere yet. Coming soon!",

  "intro_title": "A few recommendations",
  "intro_letter": [
    "Dear friend,",
    "If you get this letter, you must have arrived safely in [SETL]. I hope the journey wasn’t too rough.",
    "At the time of your arrival, the settlement must still be in a sorry state. As you’ll soon discover, life on the Continent is not easy. Some say that these plains are like a wild animal who refuses to be tamed. But if you and other brave settlers like you play their part, I’m sure we will eventually succeed.",
    "Here are a few recommendations. You won’t make a name for yourself alone. You won’t achieve much unless your settlement thrives. Collaborate with the other settlers to increase its resources and expand its territory. Try to bring back food every day, at least as much as what you eat. And follow the directions of the Governor and the Chancellors. Hell, if you do well and get noticed by your fellow settlers, you may even become Governor yourself one day!",
    "But most of all, be careful when venturing out. As you may know, we are not alone in this land. And its inhabitants have only one wish, to throw us back in the sea. As if the dangerous wildlife was not enough. It’s only a matter of time before one of the settlements is attacked. When that day comes, you will all need to be ready. Help build towers, scout ahead for enemy positions, craft or import weapons to arm everyone. Do whatever you can, but do it fast, as the sightings of hostiles are becoming more frequent.",
    "In my opinion, there is of course only one true way to defend ourselves. We need to attack first. I’m petitioning the Governor of [OTSETL] to mount an offensive. I hope your governor and his Commanders can be more receptive, before it’s too late.",
    "May you and your settlement prosper;",
    "A friend "
  ]
}