{
  "currency": "coin",
  "settlement_0": "New Beginning is the oldest settlement on the Continent. However, due to initial setbacks and grievous attacks from the natives, it is far less developed than Hope, in the north. Settlers keep coming because its location promises very lucrative yields of rare crops that grow only there and could be sold a fortune to the Mainland, once the necessary infrastructure to harvest them and to defend the settlement is put in place.",
  "settlement_1": "Hope is the most developed settlement on the Continent, and the theatre of the first steps of a promising mining industry. Only there can iron and coal be mined and decent weapons forged at the moment. This will give Hope a crucial role in fueling and leading the colonization of the Continent, but it will also make it a target for the attacks of the natives.",

  "inventory_help": "This is your inventory. Clicking on consumable items will consume them. Clicking on equipable items will equip them. Some equipment can increase your inventory size.",
  "equipment_help": "This is your equipment. Click on a piece of equipment to unequip it. You cannot equip a ranged weapon and a melee weapon at the same time. You must equip an ammo container (e.g. quiver) before equipping the corresponding ammunition (e.g. arrows).",
  "stats_help": "These are you character stats. Their values influence the success and impact of various actions. Most of them can be increased by specific pieces of equipment. They can also decrease because of fatigue or if your settlement is in food deficit!",
  "recipes_help": "The list of items that you know how to craft. Click on an item to start crafting it. This list is longer for craftsmen, who can make more advanced items. In the future, this list will only display items that can be crafted on the go; some items will require you to go to a Workshop to craft them and will only be listed there.",
  "combi_help": "After selecting an item to craft in the \"recipes\" panel, the list of ingredients will appear below. The '+' and '-' buttons allow you to select how many items to craft. If you have all the ingredients (your inventory is listed in the \"items\" panel), click on the green button to craft the item.",
  "craftitems_help": "The list of items you own, to allow you to easily see what you have and what you lack.",
  "commitment_help": "The list of buildings you are currently committed to. Committing to a building slightly increases its productivity, allowing it to produce more or to be built faster. You can only commit to a limited number of buildings at the same time. Commitment only last for a while. When it ends, the corresponding slot is freed up. Commitment is a major way to contribute to your settlement and is rewarded by civic XP and possibly gold.",
  "status_help": "Path XP is gained by performing actions related to your path. As you gain more levels, you get better at your trade. Civic XP is acquired by contributing to your settlement, primarily through commitment, and helps you gain civic levels. Higher civic levels allow you to vote for the Governor, to be named Chancellor or Commander, or even to be elected Governor yourself.",

  "battle_help": "The colored tiles delimit the battle zone. You cannot leave it until either the battle ends or you die. Other players and creatures can step into it to join the fight. ",
  "battletimer_help": "Battles are turn-based. Each fighter has a few seconds to take an action (moving, attacking, using an item, equipping something). When an action is taken or when the timer reaches 0, the turn ends and the turn of the next fighter in the list starts.",
  "battleitems_help": "The equipment pieces relevant for battle are displayed here, and below, the items you can use in battle. Click on an equipped item will unequip it and end your turn. Clicking on an item will equip or use it and end your turn. The red bar at the bottom represents your health.",
  "respawn_help": "When your health reaches 0, you collapse. Someone eventually comes to take you back to a safe location (by default the fort of your settlement), where you can get back up on your feet. This process is called \"respawn\" and takes a bit of time; you need to wait for the counter to reach 0.",

  "buildings_help": "The list of buildings belonging to the settlement. Clicking on one will focus the map on it. A golden progress bar indicates the progress of the construction of an unfinished building, while a green bar represents the health of a finished building. The number at the bottom-right corresponds to the progress of the bar. The number at the top-right (if any) indicates the productivity of the building.",
  "resources_help": "The stockpile of resources of the settlement, gathered by resource buildings or moved from the Trade Post. The capsule above indicates the amount of currency in the coffers of the Fort.",
  "setstatus_help": "Basic information about the settlement. The food surplus or deficit corresponds to the excess (or lack thereof) of food with respect to the amount that must be maintained at all times to feed the current population. Food surplus or deficit increases or decreases, respectively, the productivity of buildings and the stats of the citizens.",
  "devlvl_help": "The list of goals to meet for the settlement to be able to reach the next development level. Development levels unlock new buildings, access to new resources and many other useful things.",
  "map_help": "Represents the area around the settlement. Drag the map to have a look at the surroundings. The pins indicate buildings. The skulls indicate danger.",
  "productivity_help": "Indicates all the factors that are affecting the productivity of this building, and how. The higher the productivity, the faster the building will be built, or the more resources it will produce. Food surplus is achieved by storing enough food at the fort. Commitment indicates how many citizens are committing themselves to this building at the moment. ",
  "progress_help": "This building is under construction. You can see here how close it is to completion, and at what rate this progress increases (+x%/cycle). Committing to the construction (by clicking the 'commit' button) will help speed it up. You will be rewarded with civic XP and possibly gold.",
  "sell_help": "This panel only displays the items that you own and that the shop you are visitting is willing to buy (buying price greater than 0, as set by a chancellor). Click on an item to start selling it. The capsule at the top of the panel indicates your amount of money.",
  "buy_help": "This panel displays the items that are in stock in the shop which have a selling price greater than 0, as set by a chencellor. Click on an item to start buying it. The capsule at the top of the panel indicates the amount of money in the coffers of the building.",
  "prod_help": "This building produces resources at regular intervals called \"cycles\". Cycle duration varies from one building type to another, and can range from a few minutes to a day. The amount of resources produced after each cycle is listed in the panel, and depends on the productivity of the building. The produced resource are automatically stored in the Fort.",

  "health_advice": "You are low on health. Before venturing away from civilization, make sure to craft some red potions, or to buy some at the nearest Trade Post.",
  "equip_advice":"Your equipment is a bit light. See if you can't purchase somethig better at the nearest Trade Post.",
  "location_advice":"Looking for a building in particular? Try to find the Fort, it provides a map of the surroundings.",
  "gold_advice_food": "Go sell your food and pelts!",
  "gold_advice": "Need gold? Settlements are in demand of food and pelts. Hunt animals to acquire some.",
  "deficit_advice": "Your settlement is in food deficit! Try to find food and sell it at the Trade Post!",

  "classxp": "Path XP",
  "class_soldier": "Soldier",
  "class_craftsman": "Craftsman",
  "class_merchant": "Merchant",
  "class_explorer": "Explorer",
  "class_selection_title": "Pick your path",
  "class_selection": "Select carefully the path you'll follow. Each comes with unique benefits and will define your role in the economy and the settlement of the Continent. In the end, however, remember that all paths lead West...",
  "soldier_desc": "The Path of War. Soldiers excel in battle, be it against wildlife or humans, which is expressed by several permanent bonuses to their battle-related stats. These bonuses are also applied to any troops they may command as Commanders. Finally, only they can wield advanced battle equipment. They play an important role in the defense of settlements, securing of trade routes and attack of enemy encampments.",
  "merchant_desc": "The Path of Coin. Merchants are savvy negotiators able to make the best deals in any transaction. They are also adept managers, who can set up networks of caravans to transport goods across the Continent and own several shops per settlement. They often end up very wealthy by playing an active role in the functioning of the economy and in the distribution of resources and crafted goods.",
  "explorer_desc": "The Path of Discovery. Explorers can travel longer distances than anyone and avoid battles more easily to find rare resources only available in remote locations - or to discover these locations in the first place. In addition, their experience with nature makes them more apt to gather crafting materials from dead animals and plants. This gives them important functions as scouts and providers of useful elements.",
  "craftsman_desc": "The Path of Creation. Craftsmen are polymaths with deep knowledge of metallurgy and alchemy. As such, they can convert the fruits of the earth into weapons and the gifts of the plains into equipment and potions. Both the settlements and the other citizens rely on them for the manufacture of vital products that only they can make."
}