{
  "initData": {
    "x": 1211,
    "y": 160
  },
  "playerData": {
    "gold": 25,
    "fow": [338,386,387,388,389,437],
    "bldRecipes": [6,11]
  },
  "worldData": {
      "newbuildings":[
        {"type":11,"x":1203,"y":156,"built":true,"ownerName":"Jon"},
        {"type":11,"x":1199,"y":153,"built":true,"ownerName":"Danny"},
        {"type":3,"x":1199,"y":168,"built":false,"ownerName":"Tyrion"},
        {"type":4,"x":1190,"y":159,"built":true, "ownerName":"Arya"}
      ],
    "partialbuild": ["t2"],
    "sell": [
        ["t3",[
          [17,25],[11,500],[21,5]
        ]
      ]
    ],
    "plant": [[18,1121,168]],
    "items": [
      [7,1216,164],
      [7,1217,168],
      [7,1220,169],
      [26,1207,156],
      [26,1214,166],
      [26,1215,157]
    ]
  },
  "events":{
    "1":{
      "newanimals":[
        {"type":0,"x":1126,"y":157},
        {"type":0,"x":1123,"y":156}
      ],
      "attack":["t0","t1"]
    }
  },
  "steps": [
    {"pos":["c","c",350,146],"txt":"Welcome to Westward's tutorial. We'll cover building, trading and crafting. These activities are only a small part of what you can do in the game, but that should get you started! "},
    {"pos": null,"txt":"In addition, we'll try to convey how every single of these activities has an essential collaborative aspect to it!"},
    {"pos":[560,"c",300,100],"txt":"But first... that's you, right here, in the middle of the screen. That's your character. "},
    {"pos": null,"hook":"move","txt":"To move, simply click somewhere in the grass. Go ahead, try it!"},
    {"pos": [560,"c",300,120],"txt":"Great! All other actions take place by clicking on things, and will be covered throughout the rest of the tutorial."},
    {"pos": null, "camera":[1206,156],"txt":"See these [B11]s? They have been built by other players. Apparently, you are not alone around here."},
    {"pos": null, "camera":"keep","txt":"In Westward, players can build various buildings more or less anywhere to fulfill their needs and help them survive."},
    {"pos": ["c",450,300,120], "camera":[1199,168],"txt":"This is a construction site. Looks like someone is building a [B3]. That will be very useful to craft important items."},
    {"pos": [724,"c",300,120], "hook":"bld:any:3","txt":"Let's see how the construction is going. Click on the construction site to enter it."},
    {"pos": null,"txt":"Buildings are built by bringing construction material to them."},
    {"pos": null, "hook": "exit","txt":"Looks like [I3] is needed. Perhaps you could help? Exit the building by clicking on the door icon."},
    {"pos": null,"txt":"You can acquire [I3] by building a [B6]. It'll generate [I3] for you automatically at regular intervals."},
    {"pos": [724,"c",300,140],"txt":"The resources of the land deplete as players extract them, hence the continuous march Westward to keep finding new ones and expanding!"},
    {"pos": [50,50,300,120],"hook": "menu:build","txt":"To build a building, first open the 'Build' menu by clicking on the shovel icon, here on the left."},
    {"pos": [300,70,300,120],"hook": "bldselect:6","txt":"Find the [B6] and click on it."},
    {"pos": [280,50,300,125],"hook": "newbuilding:6","txt":"Now pick a location to build it. It will only be possible next to a forest; get closer to the forest to the east and build it there. (Click back on the shovel to cancel)"},
    {"pos": null,"txt":"Contrary to the [B3] you visited, this building doesn't require construction material, so it's built immediately!"},
    {"pos": null, "hook":"bld:own:6","txt":"Enter your [B6] by clicking on it."},
    {"pos": [10,50,300,140],"txt":"Production normally takes a bit of time, but for the sake of the tutorial, your building has magically produced [I3] in an instant!"},
    {"pos": null,"hook":"stock:t4:3:0","txt":"Since you own this building, you can take anything from it's stock. Click on the [I3] icon and take it all."},
    {"pos": null,"hook":"bld:any:3","txt":"Now exit your building and go back to the [B3] under construction."},
    {"pos":null,"txt":"You can contribute to a building's construction by giving material freely, or by selling it for money."},
    {"pos":null,"hook":"built:t2","txt":"Let's be altruistic for now. Click on the button to give all your [I3]."},
    {"pos":null,"txt":"Great! The [B3] has been built! It'll be essential to the local community's survival."},
    {"pos":null,"txt":"As you can see, players can complement and help each other, freely or for gold, to create settlements that will help them survive."},
    {"pos":[0,430,350,146],"hook":"recipe:28","txt":"Now let's have a look at crafting. Find and click the [I28] recipe in the recipes panel. [I28] is a nice first weapon to have."},
    {"pos":null,"hook":"bld:any:4","txt":"To make [I28], you need [I7], [I26] and [I21]. Let's see if the nearby [B4] doesn't sell any of it. Leave the [B3] and enter the [B4] to the north west of it."},
    {"pos":null,"hook":"inventory:21:1","txt":"You are in luck, there is [I21] for sale. This means a player crafted it somewhere else and sold it here. Click on it and buy it!"},
    {"pos":null,"hook":"inventory:7:1","txt":"Now, to find some [I7]. Exit the building and search around the forest. Click on items to pick them up."},
    {"pos":null,"hook":"inventory:26:1","txt":"Great, now pick up some [I26]."},
    {"pos":[0,490,350,80],"hook":"inventory:28:1","txt":"Now go back to the [B3], and craft one [I28]."},
    {"pos":[0,440,350,130],"txt":"This covers crafting. You helped build a [B3], which in turn allowed you to craft something you needed."},
    {"pos":null,"txt":"In addition, to obtain some ingredients, you went to the shop of another player to buy what yet another player had produced."},
    {"pos":[50,65,300,135],"txt":"You must be tired after all that. See the golden heart icon above? It represents your vigor. It decreases when you perform actions."},
    {"pos":null,"txt":"The lower your vigor, the more you will get maluses to your other stats, making you very vulnerable. The best way to replenish it is to rest somewhere."},
    {"pos":[0,435,300,135],"hook": "newbuilding:11","txt":"By now your [B6] must have produced enough [I3] for you to build your own [B11]. Go ahead and build one!"},
    {"pos":null,"hook": "bld:own:11","txt":"Enter your [B11]"},
    {"pos":null,"txt":"As you can see, the longer you stay in your [B11], the more you rest. It also works when you are offline!"},
    {"pos":null,"txt":"This is the end of the tutorial for now. It's not complete yet, other aspects will be covered in the future!"}
    
  ]
}